* Auto-save org buffers to disk
https://christiantietze.de/posts/2019/03/sync-emacs-org-files/
  #+BEGIN_SRC emacs-lisp
(add-hook 'auto-save-hook 'org-save-all-org-buffers)
  #+END_SRC

  #+RESULTS:
  | org-save-all-org-buffers |

* commention out region or line (function)

[[https://stackoverflow.com/questions/9688748/emacs-comment-uncomment-current-line][comment-or-uncomment-region-or-line code on stackoverflow]]
#+BEGIN_SRC emacs-lisp
  (defun comment-or-uncomment-region-or-line ()
    "Comments or uncomments the region or the current line 
  if there's no active region."
    (interactive)
    (let (beg end)
      (if (region-active-p)
          (setq beg (region-beginning) end (region-end)) 
        (setq beg (line-beginning-position) end (line-end-position))) 
      (comment-or-uncomment-region beg end)
      (next-line)
      )
    )


  (global-set-key "\C-c\C-c" 'comment-or-uncomment-region-or-line)
#+END_SRC

#+RESULTS:
: init.org

* org + orgmode
[[https://cestlaz.github.io/posts/using-emacs-24-capture-2/][setting evernote-like binding to org-capture F1]]
[[https://www.reddit.com/r/orgmode/comments/9kunnv/archiving_practices/][Archiving practices]]
#+BEGIN_SRC emacs-lisp

  ;;https://endlessparentheses.com/use-org-mode-links-for-absolutely-anything.html
      (org-add-link-type
       "tag" 'endless/follow-tag-link)

      (defun endless/follow-tag-link (tag)
        "Display a list of TODO headlines with tag TAG.
      With prefix argument, also display headlines without a TODO keyword."
        (org-tags-view (null current-prefix-arg) tag))
      ;;https://emacs.stackexchange.com/questions/19598/org-mode-link-to-heading-in-other-org-file
      (global-set-key (kbd "C-c l") 'org-store-link)
      (global-set-key (kbd "C-c C-l") 'org-insert-link)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)

        (use-package org
          :ensure t
          :pin org
          :config
            (setq org-log-done t)
            ;;; leave only 1 star in headlines
            (setq org-startup-indented t)
            )
        

      (setq org-startup-indented t
            org-hide-leading-stars t)

        ;;; load all frequenlty used files
        (setq path_to_org_file "~/Dropbox/Org/")
    (setq org-files (list "inbox.org"
                          "цели.org"
                          "заметки.org"
                          "инкубатор идей.org"
                          "Pr_list.org"
                          "Pr_info.org"
                          "Чтение.org"
                          "tasks.org"
                          "Some_when_maybe.org"
                          "Привычки.org"
                          "../emacs_files/init.org"))
  (setq org-agenda-files (mapcar (lambda (x) (expand-file-name x path_to_org_file)) org-files))
    (mapcar (lambda (x) (find-file x)) org-agenda-files)


        ;; setting up org capture
        (setq org-capture-templates
              '(("t" "To do item" entry (file "~/Dropbox/Org/inbox.org")
                 "* TODO %?\n%T")
                ("l" "Link" entry (file+headline "~/Dropbox/Org/links.org" "Links")
                  "* %? %^L %^g \n%T" :prepend t)))



        (defadvice org-capture-finalize
            (after delete-capture-frame activate)
          "Advise capture-finalize to close the frame"
          (if (equal "capture" (frame-parameter nil 'name))
              (delete-frame)))

        (defadvice org-capture-destroy
            (after delete-capture-frame activate)
        "Advise capture-destroy to close the frame"
        (if (equal "capture" (frame-parameter nil 'name))
            (delete-frame)))

        (use-package noflet
          :ensure t )
        (defun make-capture-frame ()
          "Create a new frame and run org-capture."
          (interactive)
          (make-frame '((name . "capture")))
          (select-frame-by-name "capture")
          (delete-other-windows)
          (noflet ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
            (org-capture)))

        (setq org-stuck-projects
              '("+PROJECT/-MAYBE-DONE" ("NEXT" "TODO") ()
                "\\<IGNORE\\>"))

      '(org-clock-into-drawer "CLOCKING")


        (setq org-archive-location
            (concat "~/Dropbox/Org/archive_all"
                    ".org::datetree/"))


      ;; refiling
      (setq org-refile-targets '(("~/Dropbox/Org/цели.org" :level . 2)))
#+END_SRC

#+RESULTS:
: ((~/Dropbox/Org/цели.org :level . 2))

